{
    "aboutourwork": "Gathering accurate and latest market information is critical to our business.We excel in understanding and developing projects based on the needs of both oversea clients and domestic clients.",
    "sourcingtitle": "Together, we develop the best proejct",
    "sourcingtitle1": "Based on our extensive global network, we receive possible deal opportunities from all over the world, such as sale and leaseback, to develop tailord deals for our clients.",
    "negotiationtitle": "Customer first deal negotiation",
    "negotiationtitle1": "Based on owners and financiers' needs, we start negotiation from the the very beginning of the deal development. Our experts in finance and tax are there to support clients all they way during the deals to reflect the domestic needs of investment, tax, and loans. All the deals are tailored for solely meet the needs of our individual client.",
    "financearramgementtitle": "Finance advice provided",
    "financearramgementtitle1": "In addition to the referral of the project, we help our clients for loan arrangement with financiers.We leverage our cultivated knowledge in each financier's specialities and requirements to bring together the best team of owner and financier for the deal. ",
    "documentationtitle": "Detailed and speedy documentation service",
    "documentationtitle1": "We develop required documents and contracts specific to each deal.As those documentations are often in English and requires time to understand, we walk our clients through the documentation and contracts so that our clients are familier with the main terms and key clauses.",
    "projectmanafementtitle": "Close coordination with related parties is a key for smooth and successful deal management",
    "projectmanafementtitle1": "Upon loan approval, we coordinate various related parties including maritime lawyers and registration agents until the day of closing.We monitor and manage the entire deal by sharing information and finalizing documents to make sure everything is ready for the Day 1. ",
    "postfixturemanagementtitle":"Closing is not the end, deals are monitored for the duration of the deal period",
    "postfixturemanagementtitle1":"We assign person in charge to manage chaterer's credit condition, develop invoices, manage required insurances during charter period. "
}